#include <stdio.h>
#include <math.h>
#include "display.h"

const uint32_t background[32] = {
    0b00000000000001111111000000000000,
    0b00000000001110000000111000000000,
    0b00000000110000001000000110000000,
    0b00000001000000001000000001000000,
    0b00000010001000001000001000100000,
    0b00000100001000000000001000010000,
    0b00001000000100000000010000001000,
    0b00010000000000000000000000000100,
    0b00010110000000000000000000110100,
    0b00100001000000000000000001000010,
    0b00100000000000000000000000000010,
    0b00100000000000000000000000000010,
    0b01000000000000000000000000000001,
    0b01000000000000000000000000000001,
    0b01000000000000000000000000000001,
    0b01011100000000000000000000011101,
    0b01000000000000000000000000000001,
    0b01000000000000000000000000000001,
    0b01000000000000000000000000000001,
    0b00100000000000000000000000000010,
    0b00100000000000000000000000000010,
    0b00100001000000000000000001000010,
    0b00010110000000000000000000110100,
    0b00010000000000000000000000000100,
    0b00001000000100000000010000001000,
    0b00000100001000000000001000010000,
    0b00000010001000001000001000100000,
    0b00000001000000001000000001000000,
    0b00000000110000001000000110000000,
    0b00000000001110000000111000000000,
    0b00000000000001111111000000000000,
    0b00000000000000000000000000000000,
};

// 範囲内であれば色を塗る
void draw_pixel(int x, int y, Color_t color, Color_t matrix[32][32])
{
    if (-15 <= x && x <= 16 && -15 <= y && y <= 16)
    {
        matrix[y + 15][x + 15] = color;
    }
}

// 線分が通るマスを塗りつぶす
void draw_line(float x0, float y0, float x1, float y1, Color_t color, Color_t matrix[32][32])
{
    float dx = fabsf(x1 - x0);
    float dy = fabsf(y1 - y0);

    int steps = (int)fmaxf(dx, dy) * 2 + 1; // 十分な分解能でステップ数決定

    for (int i = 0; i <= steps; i++)
    {
        float t = (float)i / steps;
        float x = x0 + (x1 - x0) * t;
        float y = y0 + (y1 - y0) * t;
        draw_pixel((int)roundf(x), (int)roundf(y), color, matrix);
    }
}

void draw_hand(float r, float theta, Color_t color, Color_t matrix[32][32])
{
    float x = cosf(theta) * r;
    float y = sinf(theta) * r;
    draw_line(0, 0, x, y, color, matrix);
}

void draw_background(Color_t color, Color_t matrix[32][32])
{
    for (int i = 0; i < 32; i++)
    {
        for (int j = 0; j < 32; j++)
        {
            if ((background[i] >> j) & 1)
                matrix[i][j] = color;
            else
                matrix[i][j] = OFF;
        }
    }
}
